app/controllers/bids_controller.rb

INSERT INTO "bids" ("item_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 1], ["amount", "5000.0"], ["created_at", "2018-05-25 23:26:06.193152"], ["updated_at", "2018-05-25 23:26:06.193152"]]
---
  def create
    @items = items_path
    @bid = Bid.new(bid_params)
    if @bid.save